app/controllers/annotations_controller.rb

SELECT  `annotations`.* FROM `annotations` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `annotations`
---
  def index
    @annotations = Annotation.all.paginate(page: params[:page], :per_page => 5)

INSERT INTO `annotations` (`body`, `created_at`, `updated_at`) VALUES ('Testando', '2019-05-05 20:07:11', '2019-05-05 20:07:11')
---
  def create
    @annotation = Annotation.new(annotation_params)

    respond_to do |format|
      if @annotation.save

SELECT  `annotations`.* FROM `annotations` WHERE `annotations`.`id` = 1 LIMIT 1
---
    def set_annotation
      @annotation = Annotation.find(params[:id])