app/controllers/friends_controller.rb

SELECT  `friends`.* FROM `friends` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `friends`
---
  def index
    @friends = Friend.all.paginate(page: params[:page], :per_page => 5)

INSERT INTO `friends` (`name`, `address`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('Keylane', 'Aeroporto', 'keylane@gmail.com', '86 33445566', '2019-05-05 20:08:05', '2019-05-05 20:08:05')
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 1 LIMIT 1
---
    def set_friend
      @friend = Friend.find(params[:id])